/**
 * 正则表达式工具类
 * @import doubeye/utils/Utils.js 
 */
com.doubeye.Utils.RegExprestions = {
	/**
	 *16进制字符串 
	 */
	hexString : /^[0-9a-fA-F]$/,
	/**
	 * 数字用正则表达式 
	 */
	number : {
		/**
		 * 数字字符 
		 */
		sigleNumber : /^[0-9]$/,
		/**
		 * 自然数， 符合代数学中的定义，包含正整数和0
		 */
		naturalNumber : /^[0-9]+$/,
		/**
		 * 非负整数，定义的取值范围同自然数，正则表达式更自然一些 
		 */
		nonnegativeInteger : /^\\d+$/,
		/**
		 * 正整数，符合数论中的自然数，范围为大于0的整数 
		 */
		positiveInteger : /^[0-9]*[1-9][0-9]*$/,
		/**
		 * 非正整数，即负整数和0 
		 */
		nonPositiveInteger : /^((-\\d+)|(0+))$/,
		/**
		 * 负整数 
		 */
		negativInteger : /^-[0-9]*[1-9][0-9]*$/,
		/**
		 * 整数 
		 */
		integer : /^-?\\d+$/,
	
		/**
		 * 非负浮点数
		 */
		nonnegativeFloat : /^\\d+(\\.\\d+)?$/,
		/**
		 * 正浮点数  
		 */
		positiveFloat : /^(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*))$/,
		/**
		 * 非正浮点数（负浮点数 + 0） 
		 */
		nonpositiveFloat : /^((-\\d+(\\.\\d+)?)|(0+(\\.0+)?))$/,
		/**
		 * 负浮点数 
		 */
		negativeFloat : /^(-(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*)))$/,
		/**
		 * 浮点数 
		 */
		'float' : /^(-?\\d+)(\\.\\d+)?$/,
		/**
		 * 金额 
		 */
		current : /^\d+(\.\d+)?$/
	},
	/**
	 * 字符串常用正则表达式 
	 */
	string : {
		/**
		 * 仅由字母组成的字符串，包括大小写 
		 */
		onlyCharacters : /^[A-Za-z]+$/,
		/**
		 * 仅由大写字符组成的字符串 
		 */
		onlyUpperCase : /^[A-Z]+$/,
		/**
		 * 仅由小写字符组成的字符串 
		 */
		onlyLowerCase : /^[a-z]+$/,
		/**
		 * 由英文字母（包括大小写）和数字组成的字符串 
		 */
		characterAndNumber : /^[A-Za-z0-9]+$/,
		/**
		 * 由英文字母（包括大小写），下划线和数字组成的字符串 
		 */
		characterAndNumberAndUnderscore : /^\\w+$/,
		/**
		 * 单个汉字,也有写成/^[\u0391-\uFFE5]+$/，目前没有验证 
		 */
		sigleChineseCharacher : /^[\u4e00-\u9fa5]$/,
		
		/**
		 * 双字节字符，包括中文字符 
		 */
		doubleByteCharacter : /^[^\x00-\xff]$/,
		/**
		 * 符合大部分语言变量命名的规范：字母开头，限制5-16字节，允许字母数字下划线，如果需要，可修改最后的数字达到修改长度的目的 
		 */
		variableName : /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/
	},
	/**
	 * 网络概念校验 
	 */
	internet : {
		/**
		 * 电子邮件地址 
		 */
		email : /^[\\w-]+(\\.[\\w-]+)*@[\\w-]+(\\.[\\w-]+)+$/,
		/**
		 * url 
		 */
		url : new RegExp("^((https|http|ftp|rtsp|mms)?://)" +
				"?(([0-9a-z_!~*'().&=+$%-]+: )?[0-9a-z_!~*'().&=+$%-]+@)?" + //ftp的user@
				"(([0-9]{1,3}.){3}[0-9]{1,3}" +  // IP形式的URL- 199.194.52.184
				"|" +  // 允许IP和DOMAIN（域名）
				"([0-9a-z_!~*'()-]+.)*"  + // 域名- www.
				"([0-9a-z][0-9a-z-]{0,61})?[0-9a-z]." + // 二级域名
				"[a-z]{2,6})" +  // first level domain- .com or .museum
				"(:[0-9]{1,4})?" +  // 端口- :80
				"((/?)|" +  // a slash isn't required if there is no file name
				"(/[0-9a-z_!~*'().;?:@&=+$,%#-]+)+/?)$"),
		/**
		 * 匹配HTML标记，主要看html代码片段中的尖括号（<>）是否匹配
		 */
		htmlElement : /^<(.*)>.*<\/\1>|<(.*) \/>$/,
		/**
		 * 匹配IP地址
		 */
		ipv4 : /^\d+\.\d+\.\d+\.\d+$/
	},
	/**
	 * 杂项 
	 */
	miscellaneous : {
		/**
		 * 15位身份证号 
		 */
		idNumber15 : /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/,
		 /**
		 * 18位身份证号 
		 */
		idNumber18 : /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{4}$/,
		/**
		 * 中国地区邮政编码
		 */
		chinesePostcode : /^[1-9]\d{5}(?!\d)$/,
		/**
		 * 电话号码，区号-号码。如:0739-8888888(8) 或 020-88888888 
		 */
		chinesePhoneNumber : /^\d{3}-\d{8}|\d{4}-\d{7,8}$/,
		/**
		 * qq号码，腾讯QQ号从10000开始 
		 */
		qqNumber : /^[1-9][0-9]{4,}$/,
		/**
		 * 手机号码 
		 */
		mobilePhoneNumber : /^0{0,1}13[0-9]{9}$/
	},
	/**
	 * 日期时间相关 
	 */
	dateTime : {
		/**
		 * 符合ISO_8601的时间表示，即YYYY-MM-DD 
		 */
		iso_8601Date : /^[0-9][0-9][0-9][0-9]-[0-1]{0,1}[0-9]-[0-3]{0,1}[0-9]$/,
		iso_8601Time : /^(([01]{0,1}[0-9])|(2[0-3])):[0-5]{0,1}[0-9]:[0-5]{0,1}[0-9]$/,
		iso_8601DateTime : /^[0-9][0-9][0-9][0-9]-[0-1]{0,1}[0-9]-[0-3]{0,1}[0-9] (([01]{0,1}[0-9])|(2[0-3])):[0-5]{0,1}[0-9]:[0-5]{0,1}[0-9]$/
	}
};
